      //------------------------------------------------------------------//
      // Array ProgrammStatus                                             //
      //------------------------------------------------------------------//

         dcl-ds DsPgms       psds qualified;
                 Pgm         *proc;
                 Job         char(10)  pos(244);
                 User        char(10)  pos(254);
                 Nbr         zoned(06) pos(264);
         end-ds;

      //------------------------------------------------------------------// 
