      //------------------------------------------------------------------//
      // MemCopy                                                          //
      //------------------------------------------------------------------//

         dcl-pr memcpy       extproc(*dclcase);
                 target      pointer value;
                 source      pointer value;
                 length      uns(10) value;
         end-pr;

      //------------------------------------------------------------------// 
