      //------------------------------------------------------------------//
      // Memcopy                                                          //
      //------------------------------------------------------------------//

         dcl-pr memcpy       extproc(*dclcase);
                 mctarget    pointer value;
                 mcsource    pointer value;
                 mclength    uns(10) value;
         end-pr;

      //------------------------------------------------------------------// 
