      //------------------------------------------------------------------//
      // Array Status                                                     //
      //------------------------------------------------------------------//

         dcl-ds  DsStatus    qualified;               // Status
                  Success    varchar(05) inz('true'); // Success
                  Errmsg     char(256);               // ErrorMessage
         end-ds;

      //------------------------------------------------------------------// 
